tutorial/pendulam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    sides
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    inlet
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    outlet
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    ballIn
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }

	ballOut 
	{
		type 			overset;
	}

	frontAndBack
	{
		type empty;	
	}

}


// ************************************************************************* //
